In [1]:
import re

Pattern, Match

In [16]:
pattern = re.compile(r'\b(Полоцк)(\w*)\b')

In [17]:
pattern

re.compile(r'\b(Полоцк)(\w*)\b', re.UNICODE)

In [20]:
text = '''^Исаак Самуилович Алуф (18 (30) ноября 1883, Полоцкий Полоцк, Полоцкий уезд, Витебская губерния, Российская империя — 20 июля 1935, Казань, Татарская АССР, РСФСР, СССР) — российский революционер, советский учёный, невропатолог. Доктор медицинских наук (1928), профессор (1930). Заведующий кафедрой нервных болезней (1930—1935), директор (1932—1935) Казанского государственного медицинского института.$
^\n$
^Как еврей не смог поступить в гимназию, в результате чего самостоятельно подготовился к экзаменам и получил аттестат. В 1904 году поступил в Казанский университет. Во время учёбы активно занимался революционной деятельностью, стал членом РСДРП и Казанского комитета партии, принял участие в событиях революции 1905 года в Казани. Дважды арестовывался, отсидел шесть месяцев в тюрьме, затем выслан за пределы России.$'''

In [21]:
result = re.search(pattern, text)

In [13]:
result

In [22]:
result.group()

'Полоцкий'

In [24]:
result.group(2)

'ий'

In [25]:
result.span()

(44, 52)

In [26]:
text[44:52]

'Полоцкий'

In [27]:
result.start()

44

In [28]:
result.end()

52

In [29]:
re.finditer(pattern, text)

In [30]:
for match in re.finditer(pattern, text):
    print(match.group(), match.group(2))

Полоцкий ий
Полоцк
Полоцкий ий

In [31]:
re.findall(pattern, text)

[('Полоцк', 'ий'), ('Полоцк', ''), ('Полоцк', 'ий')]

In [32]:
re.findall(r'\b[0-9]+\b', text)

['18',
 '30',
 '1883',
 '20',
 '1935',
 '1928',
 '1930',
 '1930',
 '1935',
 '1932',
 '1935',
 '1904',
 '1905']

In [34]:
re.findall(r'1(?:8|9)\d{2}', text)

['1883',
 '1935',
 '1928',
 '1930',
 '1930',
 '1935',
 '1932',
 '1935',
 '1904',
 '1905']

In [ ]:
re.match(pattern, text)
re.fullmatch(pattern, text)

In [39]:
if re.match(r'\d{2,3}', 'sfgjkkdf'):  # '123sd'.startswith('123')
    print('Yes')
else:
    print('No')

No

In [41]:
if re.fullmatch(r'[0-9]{2}-[0-9]{2}-[0-9]{2}', '34-56-78ghghj'):
    print('Yes')

In [44]:
def change(match):
    return str(int(match.group()) + 1)

re.sub(r'[0-9]', '...', text)

'Исаак Самуилович Алуф (29 (41) ноября 2994, Полоцкий Полоцк, Полоцкий уезд, Витебская губерния, Российская империя — 31 июля 21046, Казань, Татарская АССР, РСФСР, СССР) — российский революционер, советский учёный, невропатолог. Доктор медицинских наук (21039), профессор (21041). Заведующий кафедрой нервных болезней (21041—21046), директор (21043—21046) Казанского государственного медицинского института.\n\nКак еврей не смог поступить в гимназию, в результате чего самостоятельно подготовился к экзаменам и получил аттестат. В 21015 году поступил в Казанский университет. Во время учёбы активно занимался революционной деятельностью, стал членом РСДРП и Казанского комитета партии, принял участие в событиях революции 21016 года в Казани. Дважды арестовывался, отсидел шесть месяцев в тюрьме, затем выслан за пределы России.'

In [47]:
re.findall(r'(?ism)python', 'PYTHON PytHon PyThON pythoN')

['PYTHON', 'PytHon', 'PyThON', 'pythoN']

(?...)
flags=re.I (re.IGNORECASE

- re.I, re.IGNORECASE, i
- re.S, re.DOTALL, s  . (\n)  .+  'sdfhf\nsddhj\n'
- re.M, re.MULTILINE, m ^$ 

flags=(re.I|re.S)

(?ims)

In [48]:
import pandas as pd

In [54]:
data = pd.DataFrame([[1, 2, 3], [4, 5, 6]])

In [55]:
data

   0  1  2
0  1  2  3
1  4  5  6

In [56]:
data = pd.DataFrame({'col1': [1, 2, 3], 'col2': [4, 5, 6]})

In [57]:
data

   col1  col2
0     1     4
1     2     5
2     3     6

In [58]:
data = pd.DataFrame([{'col1': 1, 'col2': 2}, {'col1': 3, 'col2': 4}])

In [59]:
data

   col1  col2
0     1     2
1     3     4

In [60]:
data['col1']

#pd.Series

0    1
1    3
Name: col1, dtype: int64

In [ ]:
pip install openpyxl

In [63]:
data = pd.read_csv('titanic.csv')

In [64]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
pd.read_excel(path)
pd.read_json(path)
pd.read_csv(path)

In [65]:
data = pd.DataFrame({'col1': [1, 2, 3], 'col2': [4, 5, 6]})

In [66]:
data

   col1  col2
0     1     4
1     2     5
2     3     6

In [67]:
data.index

RangeIndex(start=0, stop=3, step=1)

In [68]:
data.columns

Index(['col1', 'col2'], dtype='object')

In [71]:
data.head(1)

   col1  col2
0     1     4

In [72]:
data.tail(1)

   col1  col2
2     3     6

In [74]:
data.sample(2)

   col1  col2
2     3     6
1     2     5

In [75]:
data.loc[0]

col1    1
col2    4
Name: 0, dtype: int64

In [76]:
data.iloc[0]

col1    1
col2    4
Name: 0, dtype: int64

In [79]:
data.iloc[1, 0]

2

In [78]:
data

   col1  col2
0     1     4
1     2     5
2     3     6

In [80]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    3 non-null      int64
 1   col2    3 non-null      int64
dtypes: int64(2)
memory usage: 176.0 bytes

In [81]:
data.describe()

       col1  col2
count   3.0   3.0
mean    2.0   5.0
std     1.0   1.0
min     1.0   4.0
25%     1.5   4.5
50%     2.0   5.0
75%     2.5   5.5
max     3.0   6.0

In [82]:
data['col1']

0    1
1    2
2    3
Name: col1, dtype: int64

In [83]:
data.col1

0    1
1    2
2    3
Name: col1, dtype: int64

In [84]:
titanic = pd.read_csv('titanic.csv')

In [85]:
titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [86]:
len(titanic)

891

In [90]:
titanic[(titanic.Survived == 1) & (titanic.Sex == 'female')]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
874,875,1,2,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C
875,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
880,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25.0,0,1,230433,26.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S

In [91]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [92]:
titanic.isna().any()

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age             True
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [93]:
titanic.Survived.mean()

0.3838383838383838

In [94]:
titanic.Survived.sum()

342

In [95]:
titanic.Survived.unique()

array([0, 1], dtype=int64)

In [96]:
set(titanic['Survived'])

{0, 1}

In [99]:
titanic.drop('Parch', axis=1, inplace=True)

In [100]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,373450,8.0500,NaN,S

In [101]:
titanic[['Survived', 'Pclass', 'Sex', 'Age']]

     Survived  Pclass     Sex   Age
0           0       3    male  22.0
1           1       1  female  38.0
2           1       3  female  26.0
3           1       1  female  35.0
4           0       3    male  35.0
..        ...     ...     ...   ...
886         0       2    male  27.0
887         1       1  female  19.0
888         0       3  female   NaN
889         1       1    male  26.0
890         0       3    male  32.0

[891 rows x 4 columns]

In [104]:
titanic.fillna(0)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,A/5 21171,7.2500,0,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,STON/O2. 3101282,7.9250,0,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,373450,8.0500,0,S
...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,211536,13.0000,0,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,0.0,1,W./C. 6607,23.4500,0,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,370376,7.7500,0,Q

In [105]:
titanic['Survived'] = titanic['Survived'].apply(lambda x: 'yes' if x else 'no')

In [106]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Ticket,Fare,Cabin,Embarked
0,1,no,3,"Braund, Mr. Owen Harris",male,22.0,1,A/5 21171,7.2500,NaN,S
1,2,yes,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,PC 17599,71.2833,C85,C
2,3,yes,3,"Heikkinen, Miss. Laina",female,26.0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,yes,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,113803,53.1000,C123,S
4,5,no,3,"Allen, Mr. William Henry",male,35.0,0,373450,8.0500,NaN,S

In [107]:
titanic['New Age'] = titanic['Age'].apply(lambda x: x + 100)

In [108]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Ticket,Fare,Cabin,Embarked,New Age
0,1,no,3,"Braund, Mr. Owen Harris",male,22.0,1,A/5 21171,7.2500,NaN,S,122.0
1,2,yes,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,PC 17599,71.2833,C85,C,138.0
2,3,yes,3,"Heikkinen, Miss. Laina",female,26.0,0,STON/O2. 3101282,7.9250,NaN,S,126.0
3,4,yes,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,113803,53.1000,C123,S,135.0
4,5,no,3,"Allen, Mr. William Henry",male,35.0,0,373450,8.0500,NaN,S,135.0

In [110]:
titanic.groupby('Survived').mean()

          PassengerId    Pclass        Age     SibSp       Fare     New Age
Survived
no         447.016393  2.531876  30.626179  0.553734  22.117887  130.626179
yes        444.368421  1.950292  28.343690  0.473684  48.395408  128.343690